20240114181242-calling_overloaded_constructors_with_this.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calling overloaded Constructors with this()</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Calling overloaded Constructors with this()</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbbaa471">1. Calling overloaded Constructors with this()</a>
<ul>
<li><a href="#org7d833b5">1.1. Example</a>
<ul>
<li><a href="#org2c43582">1.1.1. Solution</a></li>
<li><a href="#org8118eba">1.1.2. <span class="underline">Exam Trick</span></a></li>
<li><a href="#orgedc58a5">1.1.3. Infinite Cycle (Cyclic)</a></li>
<li><a href="#orgf8000a0">1.1.4. Rules</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbaa471" class="outline-2">
<h2 id="orgbbaa471"><span class="section-number-2">1.</span> Calling overloaded Constructors with this()</h2>
<div class="outline-text-2" id="text-1">
<p>
Since a <code>class</code> can contain <b>multiple overloaded</b> <code>constructors</code>, these <code>constructors</code> can actually call one another!
</p>
</div>

<div id="outline-container-org7d833b5" class="outline-3">
<h3 id="org7d833b5"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
One of the constructors takes a single <code>int</code> parameter.
The other takes an <code>int</code> and a <code>String</code>.
</p>

<p>
These <a href="20240111063906-parameter_list.html#ID-94f7186e-22e8-4636-bc8c-a4cc040d9073">parameter lists</a> are different, so the <code>constructors</code> are successfully <b>overloaded</b>.
</p>

<p>
There is a bit of duplication, as <code>this.weight</code> is assigned the same way in both constructors.
</p>

<p>
In programming, even a bit of duplication tends to turn into a lot of duplication as we keep adding “just one more thing.”
</p>

<p>
For example, imagine that we have five variables being set like <code>this.weight</code>, rather than just one.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Hamster</span> {
    <span class="org-keyword">private</span> <span class="org-type">String</span> <span class="org-variable-name">color</span>;
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">weight</span>;

    <span class="org-keyword">public</span> Hamster(<span class="org-type">int</span> <span class="org-variable-name">weight</span>, String color) { <span class="org-comment-delimiter">// </span><span class="org-comment">First constructor
</span>        <span class="org-keyword">this</span>.weight = weight;
        <span class="org-keyword">this</span>.color = color;
    }

    <span class="org-keyword">public</span> Hamster(<span class="org-type">int</span> <span class="org-variable-name">weight</span>) { <span class="org-comment-delimiter">// </span><span class="org-comment">Second constructor
</span>        <span class="org-keyword">this</span>.weight = weight;
        color = <span class="org-string">"brown"</span>;
    }
}
</pre>
</div>
</div>

<div id="outline-container-org2c43582" class="outline-4">
<h4 id="org2c43582"><span class="section-number-4">1.1.1.</span> Solution</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
What we really want is for the <b>first</b> <code>constructor</code> to <b>call</b> the <b>second</b> <code>constructor</code> with two parameters.
</p>

<p>
When <code>this()</code> is used <b>with parentheses</b>, Java calls <b>another constructor</b> on the <b>same</b> instance of the <code>class</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Hamster</span> {
    <span class="org-keyword">private</span> <span class="org-type">String</span> <span class="org-variable-name">color</span>;
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">weight</span>;

    <span class="org-keyword">public</span> Hamster(<span class="org-type">int</span> <span class="org-variable-name">weight</span>, String color) { <span class="org-comment-delimiter">// </span><span class="org-comment">First constructor
</span>        <span class="org-keyword">this</span>.weight = weight;
        <span class="org-keyword">this</span>.color = color;
    }

    <span class="org-keyword">public</span> Hamster(<span class="org-type">int</span> <span class="org-variable-name">weight</span>) {
        <span class="org-keyword">this</span>(weight, <span class="org-string">"brown"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8118eba" class="outline-4">
<h4 id="org8118eba"><span class="section-number-4">1.1.2.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Calling <code>this()</code> has one special rule you need to know.
If you choose to call it, the <code>this()</code> call must be the <b>first</b> statement in the <code>constructor</code>.
</p>

<p>
The side effect of this is that there can be <b>only one</b> call to <code>this()</code> in any constructor.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> Hamster(<span class="org-type">int</span> <span class="org-variable-name">weight</span>) {
    System.out.println(<span class="org-string">"chew"</span>);
    <span class="org-comment-delimiter">// </span><span class="org-comment">Set weight and default color
</span>    <span class="org-keyword">this</span>(weight, <span class="org-string">"brown"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgedc58a5" class="outline-4">
<h4 id="orgedc58a5"><span class="section-number-4">1.1.3.</span> Infinite Cycle (Cyclic)</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Gopher</span> {
    <span class="org-keyword">public</span> Gopher(<span class="org-type">int</span> <span class="org-variable-name">dugHoles</span>) {
        <span class="org-keyword">this</span>(5); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8000a0" class="outline-4">
<h4 id="orgf8000a0"><span class="section-number-4">1.1.4.</span> Rules</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>A <code>class</code> can contain <b>many</b> overloaded constructors, provided the signature for each is <b>distinct</b>.</li>
<li>The compiler inserts a <b>default</b> no­argument <code>constructor</code> if no <code>constructors</code> are declared.</li>
<li>If a constructor calls <code>this()</code>, then it must be the <b>first line</b> of the constructor.</li>
<li>Java does not allow <b>cyclic</b> constructor calls.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
